pascal-4.0/tutorialsOld/surfaceTracking/interTrackMHDmagFoam/rgsBlockGgi2D/constant/region_fluid/faMesh.org/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// ************************************************************************** //

polyMeshPatches               1(trackedSurface);

boundary
{
    fixedWall
    {
        type                  patch;
        ownerPolyPatch        trackedSurface;
        neighbourPolyPatch    fixedWall;
    }

    frontAndBack
    {
        type                  empty;
        ownerPolyPatch        trackedSurface;
        neighbourPolyPatch    frontAndBack;
    }
}

// ************************************************************************** //
