pascal-4.0/tutorialsOld/surfaceTracking/interTrackMHDmagFoam/rgsBlockGgi2D/0.org/region_fluid/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    trackedSurface
    {
        type            slip;
    }
    movingWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    fixedWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    "procBoundary.*"
    {
        type            processor;
        value           uniform 0;
    }
}

// ************************************************************************* //
